SIMISA@@@@@@@@@@JINX0D0t______
 
 Wagon ( SDJR_2P_40569C
      Type ( Engine )
      WagonShape ( SDJR_2P_40569C.s )
FreightAnim ( WC_Crew.s 1 1 )
 Size ( 2.50m 3.90m 9.80m )
 CentreOfGravity ( 0m 1.12m 0m )
      Centre ( 0m 0m 0m )
      Mass ( 54.05t )
 InertiaTensor ( Box (2.50m 3.90m 9.80m) )

  Coupling (
      Type ( bar )
      Spring (
      Stiffness ( 9e6N/m 5e6N/m )
      Damping   ( 1e6N/m/s  1e6N/m/s )
      Break     ( 3.2e6N 3.2e6N )
      r0        ( 2cm 4cm )
      )
      CouplingHasRigidConnection (1)
      Velocity ( 0.1m/s )
      )
      Coupling (
      Type  ( chain )
      Spring (
      Stiffness ( 9e6N/m 5e6N/m )
      Damping   ( 1e6N/m/s  1e6N/m/s )
      Break     ( 3.2e6N 3.2e6N )
      r0        ( 2cm 4cm )
      )
      CouplingHasRigidConnection (1)
      Velocity ( -0.1m/s )
      )
  Buffers (
  Spring (
  Stiffness ( 1e7N/m 0 )
  Damping ( 1e6N/m/s 0 )
  r0 ( 0m 1e9 )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 0.5deg )
  )
  Adheasion ( 0.10 0.20 2 0 )
  DerailRailHeight ( 4cm )
  DerailRailForce ( 240kN )
  DerailBufferForce ( 400kN )
  WheelRadius ( 18.25in )
  NumWheels ( 4 )
 
  Friction (
  5542N/m/s   0  6.0mph  7.912N/m/s   1.921
  5.1N/rad/s 1 -1rad/s 0 1
  )
 
  BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
  BrakeSystemType ( "Vacuum_single_pipe" )
  MaxBrakeForce( 50000N )
  MaxHandbrakeForce( 50000N )
  NumberOfHandbrakeLeverSteps( 0 )
  MaxReleaseRate( 5 )
      MaxApplicationRate( 5 )
      MaxAuxilaryChargingRate( 21 )
      BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )        
 
        Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-80b-eng01.sms" )


   Lights ( 8
   Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.07 )
   LightColour ( 80ff7200 )
   Position ( -0.1 1.77 -3.47 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.1 )
   )
   State (
   Duration ( 0.07 )
   LightColour ( 80ffe610 )
   Position ( -0 2.25 -3.2 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )
   
   Light ( 
   comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 01.4 -2.0 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.4 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.0 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.0 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.0 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.0 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -1.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
                       )
                 )
            )
     
   Light (
   comment( Sphere of light for Exhaust )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
    State (
    Duration ( 0.0 )
    LightColour ( 80ffe610 )
    Position ( 0 10.0 -10.0 )
    Transition ( 0 )
    Radius ( 6.0 )
    Angle ( 90.0 )
                       )
               )
         )
   Light (
   comment( Inside Cab Glare )
    Type  ( 0 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
       State (
    Duration ( 0.05 )
    LightColour ( 80ffe610 )
    Position ( 0 2.1 -4.0 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 1.5 )
    Elevation ( -25 -25 -25 )
    )
    State (
    Duration ( 0.05 )
    LightColour ( 80ffe610 )
    Position ( 0 2.1 -4.0 )
    Azimuth ( 0.0 -5.0 5.0 )
    Transition ( 0 )
    Radius ( 1.5 )
    Elevation ( -25 -25 -25 )
      )
    )
   )
   Light (
   comment( Inside Cab Glare Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle  ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.1 -4.0 )
   Azimuth ( -180 -180 -180  )
   Transition ( 0 )
   Radius ( 1.5 )
   Elevation ( -25 -25 -25 )
    )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( 0 2.1 -4.0 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.5 )
   Elevation ( -25 -25 -25 )
    )
    
   )
  )
   
  
   Light (
   comment( Flickering Ashpan  )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0.3 0.6 -1.0 )
   Azimuth ( 45 45 45 )
   Transition ( 0 )
   Radius ( 1.1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.6 -1.0 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.0 )
         
      )
    )
   )

   Light (
   comment( Flickering Ashpan  )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( -0.3 0.6 -1.0 )
     Azimuth ( 180 180 180 )
     Transition ( 0 )
     Radius ( 1.1 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( 0 0.6 -1.0 )
     Azimuth ( 180 180 180 )
     Transition ( 0 )
     Radius ( 1.0 )
         
       )
     )
   )
  
   Light ( 
    comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 2.79 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 2.79 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 2.79 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 2.79 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 2.79 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 2.79 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 2.79  )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 2.79 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22  2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 2.79 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.2 ) 
                  )
               )
          )

  ) 
 
 )  
 
 
 Engine ( SDJR_2P_40569C
     Effects
     (
         SteamSpecialEffects
         (
   comment
   (
   the format of these little blocks is as follow:

   offset.x offset.y offset.z
   normal.x normal.y normal.z
   width in metres
   defining the offset from the shape pivot point
   where steam / smoke should appear, the direction
   it should go and the width of the nozzle
   )

   WhistleFX
   (
    -0.2 3.8 -2.975
    0 0.9 0
    0.15
   )

   SafetyValvesFX
   (
    0 3.8 -2.650
    0 0.6 0
    0.25
   )
   SafetyValvesFX
   (
    0 3.6 -2.650
    0 1.2 0
    0.2
   )
   StackFX
   (
    0 4.1 2.79
    0 0.9 0
    0.2
   )
   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )

   CylindersFX
   (
    -0.4 0.5 3.5
    -0.1 -0.4 1.2
    0.1
   )

   CylindersFX
   (
    0.4 0.5 3.5
    0.1 -0.4 1.2
    0.1
   )
  )
 )

         
     Wagon (SDJR_2P_40569C)
     IsTenderRequired ( 1 )
     Type ( Steam )
     MaxPower ( 896hp )
     MaxForce ( 17729lbf )
     MaxVelocity ( 81mph )
     WheelRadius ( 42.25in )
     Sanding ( 1e9mph )
     NumWheels ( 4 )
     BoilerLength ( 130.5in )
     BoilerRadius ( 28in )
     BoilerVolume ( "286121*(in^3)" )
     BoilerEffectivity ( 1.25 )
     DraftingEffect ( 1.25 )
     BoilerResponsiveness ( 1 )
     CoalBurnage ( 7.0lb/hp/h )
     MaxBoilerOutput ( 19500lb/h )
     NumCylinders ( 2 )
     CylinderStroke ( 26in )
     CylinderDiameter ( 19in )
     CylinderVolume ( "8.53*(ft^3)" )
     CylinderEffectivity ( 4 )
     InjectorSizes ( 10mm 10mm )
     ExhaustLimit ( 19500lb/h )
     PrimingFactor ( 1 )
  SteamMinPrimingLevel ( 1 )
  SteamPrimingPowerLossProportion ( 0.20 )
  SteamPrimingWaterUsageIncreaseProportion ( 0.25 )
  SteamPrimingInjectorsFailAtLevel ( 1.25 )
  SteamPrimingReductionWithCylinderCocksOpen ( 0.25 )

     BlastExponent ( 0.4375 )
     MaxBoilerPressure ( 180psi )
     MaxFireMass ( 1848lb )
     IdealFireMass ( 1848lb )
     MaxWaterMass ( 2957lb )
     SafetyValvesSteamUsage ( 6250lb/h )
     ShovelCoalMass ( 25lb )
     SmokeCombustion ( 20 )
     MaxTenderCoalMass ( 8960lb )
     MaxTenderWaterMass ( 32500lb )
     InjectorTypes( 0 0 )
     SuperHeater ( 1.25 )
     SteamSmokeUnitsPerPoundOfFuel( 1 )
     SteamMaxSmokeUnitsReleaseRate( 20 )
     MaxSteamHeatingPressure( 40 )
     SafetyValvePressureDifference( 5 )
     SteamGaugeGlassHeight( 10 )
 
     BasicSteamUsage ( 1000lb/h )
     BasicCoalUsage ( 450lb/h )
     InjectorLimits1 ( 50psi 0.3 1 )
     InjectorLimits2 ( 50psi 0.3 1 )
 Injector1FeedrateMultiplierExhaust ( 1.25 )
      Injector1FeedrateMultiplierLive ( 1 )
      Injector2FeedrateMultiplierExhaust ( 1.25 )
      Injector2FeedrateMultiplierLive ( 1 )
      Injector1WaterValveVariance ( 1 )
      Injector2WaterValveVariance ( 1 )

     CylinderCocksPowerEfficiency ( 0.9 )
     SteamCylinderCocksOperation ( Manual )
 
     VacuumBrakesSmallEjectorPowerRating ( 35 )
     VacuumBrakesMinBoilerPressureMaxVacuum ( 90 )
     VacuumBrakesSmallEjectorUsageRate ( 420 )
     VacuumBrakesLargeEjectorUsageRate ( 1700 )
     VacuumBrakesHasVacuumPump ( 0 )
     TrainBrakesControllerMaxReleaseRate ( 0.70 )
     TrainBrakesControllerMinSystemPressure ( 0 )
     TrainBrakesControllerMaxSystemPressure ( 21 )
     EngineBrakesControllerHasProportionalBrake ( 1 )
     EngineBrakesProportionalBrakeLag ( 0.9 )
 
     BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
     BrakesTrainBrakeType ( "Vacuum_single_pipe" )
     BrakesEngineControllers( "Hand, Train" )
 
     SteamSmallestCutoff ( 5 )
     NumberOfDamperSteps ( 5 )
 
  RegulatorValveType ( Twin_port )
  RegulatorPilotValveExponent( 1 )
  RegulatorPilotValveFullOpening( 0.95 )
  RegulatorSecondValveExponent( 1 )
  RegulatorSecondValveStartPosition( 0.5 )
  RegulatorMainValveInitialOpenning( 0.6 )

  SteamBlowerEffectExponent( 1 )
  SteamBlowerEfficiencyExponent( 1 )
  SteamBlowerMaxSteamUsageRate( 1200 )comment( lbs/h )
  SteamBlowerMaxProportionOfBlastEffect( 0.25 )

  SteamWaterScoopMinPickupSpeed( 25 ) comment( mph )
  SteamWaterScoopMaxPickupSpeed( 75 ) comment( mph )
  SteamWaterScoopResistance( 8500N )
  comment( pounds per second. 2000gallons per minute max. )
  SteamWaterScoopMaxPickupRate( 2000 )

  SteamSmokeUnitsPerPoundOfFuel( 0.75 )


     CabView ( "..\\..\\common.cab\\RF_Fowler_Cabs\\FOWLER_TENDER_CAB.cvf" )
     HeadOut (  1.35 3.0 -5.1 )


        EngineControllers (
            comment( Engine controls )
        
            Regulator ( 0 1 0.02 0 
                NumNotches( 0 )
            )
            Cutoff    ( -0.75 0.75 0.01 0 
                NumNotches( 0 )
            )
            Brake_Train ( 0 0.99 0.0475 0.65 
            NumNotches ( 4
            Notch( 0     0 TrainBrakesControllerReleaseStart )
            Notch( 0.05  0 TrainBrakesControllerRunningStart )
    Notch( 0.2   0 TrainBrakesControllerSelfLapStart )
            Notch( 0.3   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.075 1 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.035 0 
                NumNotches( 5 
                    Notch ( 0    0 Dummy )
                    Notch ( 0.25 1 Dummy )
                    Notch ( 0.5  1 Dummy )
                    Notch ( 0.75 1 Dummy )
                    Notch ( 1    1 Dummy )
    
       )
            )
            Shovel ( 0 1 1 0 
            NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 0.25 
                NumNotches ( 5 
                    Notch ( 0    0 Dummy )
                    Notch ( 0.25 0 Dummy )
                    Notch ( 0.5  0 Dummy )
                    Notch ( 0.75 0 Dummy )
         Notch ( 1  0 Dummy )
       )
     )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                    NumNotches( 5 
         Notch ( 0    0 Dummy )
                    Notch ( 0.25 0 Dummy )
                    Notch ( 0.5  0 Dummy )
                    Notch ( 0.75 0 Dummy )
                    Notch ( 1    0 Dummy )

       )
            )
            Injector2Water ( 0 1 0.1 0 
                    NumNotches( 5 
         Notch ( 0    0 Dummy )
                    Notch ( 0.25 0 Dummy )
                    Notch ( 0.5  0 Dummy )
                    Notch ( 0.75 0 Dummy )
                    Notch ( 1    0 Dummy )

       )
    )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

  comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
  EngineVariables( 750 1800 2275 185 0.75 3250 1 1 1 0.75 )

        Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-100b-cab01.sms" )
        Name ( "SDJR_2P_40569C" )
    Description (
 	""

	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)
